

// Вивести в консоль всі числа від 1 до 10 за допомогою циклу while


let i = 1 
while(1<=10){
    i+= 1; 
    console.log(i);
    
}









// Вивести в консоль всі парні числа від 2 до 20 за допомогою циклу for.
//  Якщо число парне, пропустити його за допомогою continue.


for (let i = 2; i <= 20; i += 2) {
    if (i % 2 === 0) {
        console.log(i);
        
    }

}




// Вивести в консоль таблицю множення числа 7 за допомогою циклу for.

for (let i = 1; i <= 10; i += 1) {
    console.log(`7 * ${i} = ${7 * i}`);
    
}



// Створити скрипт, який виводить в консоль всі числа , які менші за n.
//  Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути 
//  закінчений за допомогою break.


let n = 21;
for (let i = 1; i <= 100; i++) {
    if (i > n) {
        break;
    }
    console.log(i);
    
}





// За допомогою циклу while вивести в консоль всі числа від 1 до 20,
//  крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен 
//  продовжити виконання за допомогою оператора continue.


let numberes = 1;

while (numberes <= 20) {
    if (numberes % 3 === 0) {
        numberes++;
        continue;
    }
    console.log(numberes);
    numberes++;
}











